SIMISA@@@@@@@@@@JINX0D0t______
 
Wagon ( 42085T-B
    Type ( Engine )
    WagonShape ( ccw_br_4mt_42085_LC.s )
    Size  ( 2.687606m 3.855m 14.42424m )
    Mass ( 85.25t-uk )
	Coupling (
		Type ( Chain )
		Spring (
			Break ( 600kN 1000kN )
			r0 ( 18cm 0cm )
		)
	)

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 234kN ) Comment(55% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 85kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)    

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.5m 0.06m )
Comment(0.06 to equalise front and rear coupling)
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft 4in )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 5628 )
ORTSDavis_B ( 28.5 )
ORTSDavis_C ( 5.502 )

ORTSWagonFrontalArea (103ft^2)
ORTSDavisDragConstant (0.0024)

Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

Comment ( ==Passenger View== )
	Inside (
       PassengerCabinFile (  ccw_br_4mt_42085_LC.s   )
       PassengerCabinHeadPos ( 1.5 3.0 -2 )
       RotationLimit ( 180 180 0 )
       StartDirection ( 0 0 0 )
    	)

FreightAnim ( "..\\common.headcodes\\CCW_Fairburn\\ccw_fairburn_HC_Class_B.s" 0 3.0 0.0 )

IntakePoint ( 0.7 8 FuelWater )
IntakePoint ( -3.85 8 FuelCoal )

Sound (	"..\\..\\Common.Steam\\2Cylinder\\L1eng.sms" )


Lights	( 9
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)
		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.2 -4.8 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1 )
					)
				)
			)
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 2.1 -4.7 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.1 -4.7 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
		Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (-0.5 0.9 -4.1)
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (-0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (-0.5 0.9 -4.1 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 2 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position (0.5 0.9 -4.1)
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position (0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position (0.5 0.9 -4.1 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( Front White Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( 0.0 3.35 6.1 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( 0.0 3.35 6.1 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Rear Red Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0 2.85 -6.83 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( 0 2.85 -6.83 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		)
	)
 
Engine ( 42085T-B
	Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.95 -2.1
				0 0.8 0
				0.35
			)

			SafetyValvesFX
			(
				0 3.90 -1.1
				0 0.6 0
				0.35
			)
			StackFX
			(
				0 3.8 4.7
				0 1 0
				0.2
			)

			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			CylindersFX
			(
				-1.2 0.65 5
				0 0.0875 1
				0.2
			)
			CylindersFX
			(
				1.2 0.65 5
				0 0.0875 1
				0.2
			)
			Injectors2FX
			(
			-1.026 0.85 -3.1
			0 -1 0
			0.15
			)
			Injectors1FX
			(
			1.026 0.85 -3.1
			0 -1 0
			0.15
			)

		)
	)

Wagon ( 42085T-B )
ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 34.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 50.3t-uk  )  
Sanding (25mph)
IsTenderRequired (0)

Comment(ORTSMaxIndicatedHorsepower ( 1120.0hp )) 
    
Comment ( *** Cylinders *** )
    NumCylinders ( 2 )
    CylinderStroke ( 26in ) 
    CylinderDiameter ( 19.625in ) 

Comment ( *** Boiler *** )
    ORTSSteamBoilerType ( Superheated )
    BoilerVolume ( 180ft^3 )     
    ORTSEvaporationArea ( 1369ft^2 )
    ORTSSuperheatArea ( 240ft^2 )
    MaxBoilerPressure ( 200psi )
    MaxSteamHeatingPressure ( 50psi )
    ORTSBoilerEvaporationRate ( 15 )
    ORTSMaxSuperheatTemperature ( 250.0 )


ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 ) 
Comment(From 4MT Report)

Comment ( *** Fire *** ) 
    ORTSFuelCalorific ( 13700btu/lb )
    ORTSGrateArea ( 26.7ft^2 )
    SteamFiremanMaxPossibleFiringRate( 3000 ) 
    ShovelCoalMass ( 14lb )

ORTSBurnRate( 0.0 100.0   9000.0 1000.0   17500.0 2000.0  24000.0 3000.0   29000.0  4000.0  33000.0 5000.0 )

Comment ( *** Fuel *** )
    	MaxTenderCoalMass ( 3.5t-uk )
    	MaxTenderWaterMass ( 20000lb )
 
Comment ( == Brake valve == )   
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 21 )
 	BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
 	BrakeSystemType ( "Vacuum_single_pipe" )


EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
		 ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Sound (	"..\\..\\Common.Steam\\2Cylinder\\L1cab.sms" )

Cabview ( 5XP.cvf )
HeadOut (  -1.5 3.0 -2 )


Name ( "42085 Fairburn Tank 4P Late Crest, Class B, TE 24.7Klbf" )

Description ("The London, Midland and Scottish Railway (LMS) Fairburn Tank 2-6-4T is a class of steam locomotive. They were designed by Charles E. Fairburn for the LMS. 277 of these locomotives were built between 1945 and 1951, numbered in the range 42050–42186, (4)2187–(4)2299, (4)2673–(4)2699.\n"+
"\n"+
"This design was based on the earlier Stanier LMS Stanier 2-6-4T, which was derived from Henry Fowler's LMS Fowler 2-6-4T engine. Fairburn modified the design to have a shorter wheelbase, reduced from 16 ft 6 in (5.03 m) to 15 ft 4 in (4.67 m) allowing curves of 5 chains to be negotiated; to reduce the locomotives mass per unit length the overall weight was reduced by 3 long tons 8 cwt.\n"+
"\n"+
"It was also the basis for the later British Railways Standard Class 4 tank. They were used mainly for suburban passenger trains. Forty-one examples of the class were constructed by Brighton railway works for service on the Southern Region of British Railways in 1950 and 1951, replacing earlier designs. Of these, seven were transferred to the North Eastern Region between Spring 1952 and the end of 1954; the other 34 were exchanged for a like number of London Midland Region BR Standard Class 4 2-6-4T locomotives at the end of 1959."
)
)